module.exports.godine = [
  {
    godina: "I",
    predmeti: [
      { id: 10002, naziv: "Основи електротехнике I" },
      { id: 10003, naziv: "Програмирање I" },
      { id: 10009, naziv: "Основи електротехнике II" },
      { id: 10011, naziv: "Физика" },
    ],
  },

  {
    godina: "II",
    predmeti: [
      { id: 20101, naziv: "Програмски језици I" },
      { id: 20102, naziv: "Структуре података и алгоритми" },
      { id: 20103, naziv: "Увод у електронику" },
      { id: 20104, naziv: "Кола и сигнали" },
      { id: 20105, naziv: "Електрична мјерења" },
      { id: 20106, naziv: "Математика IV" },
      { id: 20107, naziv: "Програмски језици II" },
      { id: 20108, naziv: "Основи оперативних система" },
      { id: 20109, naziv: "Основи комуникација и теорија информација" },
      { id: 20110, naziv: "Линеарна електроника" },
    ],
  },
];

module.exports.rokovi = [
  {
    naziv: "Јануарско фебруарски испитни рок",
    termini: [
      {
        id: 9,
        vrijeme: "05.02.2021. 09:00",
        mjesto: "сала 1103",
      },
      {
        id: 10,
        vrijeme: "19.02.2021. 09:00",
        mjesto: "сала 1103",
      },
    ],
  },
  {
    naziv: "Априлски испитни рок",
    termini: [
      {
        id: 11,
        vrijeme: "07.05.2021. 13:00",
        mjesto: "сала 1103, 1108",
      },
    ],
  },
  {
    naziv: "Јунско јулски испитни рок",
    termini: [
      {
        id: 12,
        vrijeme: "18.06.2021. 09:00",
        mjesto: "сала 1103",
      },
      {
        id: 13,
        vrijeme: "02.07.2021. 09:00",
        mjesto: "сала 1103",
      },
    ],
  },
  {
    naziv: "Септембарски испитни рок",
    termini: [
      {
        id: 14,
        vrijeme: "27.08.2021. 09:00",
        mjesto: "сала 1103",
      },
      {
        id: 15,
        vrijeme: "10.09.2021. 09:00",
        mjesto: "сала 1103",
      },
    ],
  },
  {
    naziv: "Октобарски испитни рок",
    termini: [
      {
        id: 16,
        vrijeme: "08.10.2021. 09:00",
        mjesto: "сала 1103",
      },
    ],
  },
];
